# dataframe

In [ ]:
# dataframe is a labeled 2-dimensional array
# it contains multiple rows and columns

In [1]:
# each column of dataframe act as series
# hence , dataframe is nothing but collection of series objects

In [4]:
import pandas as pd

eno = [10,20,30,40]
ename = ["nitin" , "tina" , "arun" ,"riya"]
esal = [1000,2000,3000,4000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla"]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [7]:
print(df.ndim)
print(df.shape)

2
(4, 4)

In [8]:
type(df)

pandas.core.frame.DataFrame

In [11]:
type(df.ename)

pandas.core.series.Series

In [16]:
df.dtypes    # for 2-d we need to use dtypes

eno       int64
ename    object
esal      int64
eadrs    object
dtype: object

In [22]:
import pandas as pd

eno = [10,"ram",30.5,"a"]

s = pd.Series(eno)
s

0      10
1     ram
2    30.5
3       a
dtype: object

In [2]:
#oops program.1
class person: #create class as person
    def __init__(self,name,age): #inhertance default value self with other parameters
        self.name=name #call with object.1
        self.age=age #call with object.2
p1=person("noida",15) #create p1 object for paerson class
p2=person("raja nahar singh",24)
print(p2.name) #function call.1
print(p2.age) #function call.2

raja nahar singh
24

In [ ]:
#oops program.1
class person: #create class as person
    def init (sname,age): #inhertance default value self with other parameters
        self.name=name #call with object.1
        #call with object.2
p1=person("noida",15) #create p1 object for paerson class
p2=person("raja nahar singh",24)
print(p2.name) #function call.1
print(p2.age) #function call.2

TypeError: person() takes no arguments

In [3]:

class data_analyst: #create class as person
    def __init__(self,name,course): #inhertance default value self with other parameters
        self.name=name #call with object.1
        self.course=course #call with object.2
ritika=person("Rittika shukla","Data analyst") #create p1 object for paerson class
suryam=person("suryam sourya","Data analyst")
muskan=person("Muskan Patyal","Data analyst")
print(ritika.name, ritika.course) #function call.1
print(muskan.name, muskan.course) #function call.2
print(suryam.name, suryam.course)

AttributeError: 'person' object has no attribute 'course'

# various ways to create dataframe object

In [23]:
# 1.  from dict of list objects

In [1]:
# here each key acts as column name and values is list of values for that column

In [2]:
import pandas as pd

eno = [10,20,30,40]
ename = ["nitin" , "tina" , "arun" ,"riya"]
esal = [1000,2000,3000,4000]
eadrs = ["doon" , "delhi" , "rishikesh" , "shimla"]

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [28]:
# 2. from dict of tuple objects
# instead of list objects we can use tuple objects also

In [29]:
import pandas as pd

eno = (10,20,30,40)
ename = ("nitin" , "tina" , "arun" ,"riya")
esal = (1000,2000,3000,4000)
eadrs = ("doon" , "delhi" , "rishikesh" , "shimla")

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [31]:
# 3. from dict of series objects

# dataframe is nothing bt collection of series objects

In [33]:
import pandas as pd

eno = pd.Series([10,20,30,40])
ename = pd.Series(["nitin" , "tina" , "arun" ,"riya"])
esal = pd.Series([1000,2000,3000,4000])
eadrs = pd.Series(["doon" , "delhi" , "rishikesh" , "shimla"])

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [34]:
# 4. from dict of dicts

In [4]:
import pandas as pd

eno = {0:10,1:20,2:30,3:40}

ename = {0:"nitin" , 1:"tina" , 2:"arun" ,3:"riya"}

esal = {0:1000,1:2000,2:3000,3:4000 }

eadrs = {0:"doon" , 1:"delhi" , 2:"rishikesh" , 3:"shimla"}

df = pd.DataFrame({"eno":eno , "ename":ename , "esal":esal , "eadrs":eadrs})

df

   eno  ename  esal      eadrs
0   10  nitin  1000       doon
1   20   tina  2000      delhi
2   30   arun  3000  rishikesh
3   40   riya  4000     shimla

In [37]:
# 5. from list of dicts

In [6]:
import pandas as pd

d1 = {"eno":10, "ename":"tina" , "esal":1000 , "eadrs":"rishikesh"}

d2 = {"eno":20, "ename":"nitin" , "esal":2000 , "eadrs":"delhi"}

d3 = {"eno":30, "ename":"riya" , "esal":3000 , "eadrs":"doon"}

d4 = {"eno":40, "ename":"sachin" , "esal":4000 , "eadrs":"shimla"}

l = [d1,d2,d3,d4]

df = pd.DataFrame(l)

df

   eno   ename  esal      eadrs
0   10    tina  1000  rishikesh
1   20   nitin  2000      delhi
2   30    riya  3000       doon
3   40  sachin  4000     shimla

In [1]:
# list of list

In [2]:
import pandas as pd

l1 = [10,20,30,40]
l2 = ["nitin" , "tina" , "arun" ,"riya"]
l3 = [1000,2000,3000,4000]
l4 = ["doon" , "delhi" , "rishikesh" , "shimla"]

df = pd.DataFrame([l1,l2,l3,l4] ,columns  = ["a"  , "b" , "c" , "d"] )

df

       a      b          c       d
0     10     20         30      40
1  nitin   tina       arun    riya
2   1000   2000       3000    4000
3   doon  delhi  rishikesh  shimla

In [3]:
x = [[10,20,30,40] , ["nitin" , "tina" , "arun" ,"riya"],[1000,2000,3000,4000],
     ["doon" , "delhi" , "rishikesh" , "shimla"]]

pd.DataFrame(x)

       0      1          2       3
0     10     20         30      40
1  nitin   tina       arun    riya
2   1000   2000       3000    4000
3   doon  delhi  rishikesh  shimla